app/views/testfiles/_form.html.erb

    <%= f.label :mat_name %><br>
    <%= f.select :mat_name, options_for_select(Material.all.map{|s|[s.mat_name]}) %>
---
SELECT "materials".* FROM "materials"

    <%= f.label :groupname %><br>
    <%= f.select :groupname, options_for_select(Group.all.map{|s|[s.groupname]}) %>
---
SELECT "groups".* FROM "groups"