app/views/groups/index.html.erb

      <tr>
        <td><%= group.groupname %></td>
---
SELECT "groups".* FROM "groups"