app/views/mat_memberships/_form.html.erb

SELECT "materials".* FROM "materials"
---
    <%= f.label :mat_name %><br>
    <%= f.select :mat_name, options_for_select(Material.all.map{|s|[s.mat_name]}) %>

SELECT "groups".* FROM "groups"
---
    <%= f.label :group_name %><br>
    <%= f.select :group_name, options_for_select(Group.all.map{|s|[s.groupname]}) %>