app/controllers/mat_memberships_controller.rb

  def index
    @mat_memberships = MatMembership.all
---
SELECT "mat_memberships".* FROM "mat_memberships"