app/controllers/materials_controller.rb

SELECT "materials".* FROM "materials" WHERE ((LOWER(materials.mat_name) LIKE 'mat36_al%' OR LOWER(materials.mat_type) LIKE 'mat36_al%')) ORDER BY LOWER(materials.mat_name) asc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "materials" WHERE ((LOWER(materials.mat_name) LIKE 'mat36_al%' OR LOWER(materials.mat_type) LIKE 'mat36_al%'))
---
  def index
    @filterrific = Filterrific.new(Material, params[:filterrific] || session[:filterrific_materials])
    @materials = Material.filterrific_find(@filterrific).page(params[:page])

SELECT "testfiles".* FROM "testfiles" WHERE "testfiles"."mat_name" = 'Mat36_AL6060'
---
  def show
	@testfiles = Testfile.where(:mat_name => @material.mat_name)

INSERT INTO "materials" ("created_at", "mat_name", "mat_type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Mar 2015 07:07:22 UTC +00:00], ["mat_name", "NewMaterial"], ["mat_type", "Metal"], ["updated_at", Tue, 03 Mar 2015 07:07:22 UTC +00:00]]
---
  def create
    @material = Material.new(material_params)

    respond_to do |format|
      if @material.save

UPDATE "materials" SET "mat_type" = ?, "updated_at" = ? WHERE "materials"."id" = 15  [["mat_type", "Mixture"], ["updated_at", Tue, 03 Mar 2015 07:06:57 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @material.update(material_params)

SELECT "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT 1  [["id", "15"]]
---
    def set_material
      @material = Material.find(params[:id])