app/controllers/password_resets_controller.rb

  def edit
  @user = User.find_by_password_reset_token!(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = 'cfV0qGuYGPb-GC4JLIk9_Q' LIMIT 1

  def update
  @user = User.find_by_password_reset_token!(params[:id])
  if @user.password_reset_sent_at < 2.hours.ago
    redirect_to new_password_reset_path, :alert => "Password reset has expired."
  elsif @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = 'cfV0qGuYGPb-GC4JLIk9_Q' LIMIT 1
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 16  [["password_digest", "$2a$10$/INCKnKqZtHqQON6IGjLyei239tJfVwki1cZTyIIGxJwHXVrzLRrO"], ["updated_at", Mon, 09 Feb 2015 22:31:34 UTC +00:00]]