app/controllers/testfiles_controller.rb

  def index
    @testfiles = Testfile.all
---
SELECT "testfiles".* FROM "testfiles"

  def download
   @file = Testfile.find(params[:id])
---
SELECT "testfiles".* FROM "testfiles" WHERE "testfiles"."id" = ? LIMIT 1  [["id", "16"]]