app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 16 LIMIT 1
---
  def index
	@user = User.find_by_id(current_user[:id])

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 16  [["password_digest", "$2a$10$WCvmdAUzJezx1TdVdpvdou6rvOvTvGjgCPv5e5HNLIezR1XTTvTdm"], ["updated_at", Tue, 03 Mar 2015 05:56:12 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)