app/views/materials/_list.html.erb

			<% end %>
			<% @files_groups = Testfile.where(:mat_name => material.mat_name) %>
---
SELECT "testfiles".* FROM "testfiles" WHERE "testfiles"."mat_name" = 'NewMaterial'